using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Unipi_Guide
{
    public partial class plhform12 : Form
    {
        public plhform12()
        {
            InitializeComponent();
        }

        private void button2_Click(object sender, EventArgs e)
        {
            About f6 = new About();
            f6.Show();
            this.Close();
        }

        private void button3_Click(object sender, EventArgs e)
        {
            Dplh pp1 = new Dplh();
            pp1.Show();
            this.Close();
        }

        private void button1_Click(object sender, EventArgs e)
        {
            Application.Exit();
        }

        private void label16_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Το εργαστήριο Τεχνολογίας Λογισμικού έχει ως κύριο στόχο την προώθηση της βασικής έρευνας και της υψηλής ποιότητας διδασκαλίας σε καίρια και σύγχρονα θέματα της Τεχνολογίας Λογισμικού, Εκπαιδευτικού Λογισμικού, Μοντελοποίησης χρηστών, Μηχανικής μάθησης και Αναγνώρισης προτύπων, Ανάλυσης Εικόνας, Τεχνητής Αίσθησης και Διαδικτυακής Νοημοσύνης.");
        }

        private void plhform12_Load(object sender, EventArgs e)
        {
            webBrowser1.Navigate("https://www.cs.unipi.gr/index.php?option=com_k2&view=item&layout=item&id=187&Itemid=769&lang=el");
            webBrowser1.ScriptErrorsSuppressed = true;
        }

        private void label11_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Το Εργαστήριο Πληροφορικών Συστημάτων ιδρύθηκε το 2001. Είναι θεσμοθετημένο εργαστήριο του Τμήματος Πληροφορικής του Πανεπιστημίου Πειραιώς. Κύριος σκοπός του εργαστηρίου είναι η υποστήριξη των εκπαιδευτικών και ερευνητικών δραστηριοτήτων του Τμήματος Πληροφορικής στο ευρύ επιστημονικό πεδίο των Πληροφοριακών Συστημάτων και των εφαρμογών τους.");
        }

        private void label12_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Οι ερευνητικές δραστηριότητες του εργαστηρίου εστιάζουν στα πεδία των συστημάτων υποστήριξης αποφάσεων, μεθοδολογιών μέτρησης αποδοτικότητας συστημάτων, πολυκριτηριακής ανάλυσης αποφάσεων, διαχείρισης γνώσης, ανάλυσης δεδομένων και εξόρυξης γνώσης. Αναλαμβάνει δια των μελών του την διοργάνωση ειδικών θεματικών ενοτήτων σε διεθνή συνέδρια Επιχειρησιακής Έρευνας.");
        }

        private void label13_Click(object sender, EventArgs e)
        {
            MessageBox.Show(" Οι δραστηριότητες έρευνας και διδασκαλίας του εργαστηρίου επεκτείνονται σε διάφορους τομείς της επιστήμης των υπολογιστών και της ασφάλειας δίνοντας ιδιαίτερη έμφαση στον τομέα των τηλεπικοινωνιών, των δικτύων και της ασφάλειας υπολογιστικών συστημάτων σε ασύρματες εφαρμογές και τεχνολογίες πληροφοριών και επικοινωνιών στον τομέα της υγειονομικής περίθαλψης. Οι τομείς ενδιαφέροντος του εργαστηρίου μεταξύ άλλων περιλαμβάνουν την ενεργειακή απόδοση, τον έλεγχο ισχύος, τον έλεγχο απόδοσης, την ανάλυση παρεμβολών, τις πράσινες επικοινωνίες, τα συστήματα πληροφοριών, το απόρρητο των δεδομένων και σχετικές ρυθμίσεις με την Ελλάδα και την Ευρωπαϊκή Ένωση, εφαρμογές πληροφορικής και ασφάλεια στον τομέα της υγειονομικής περίθαλψης, ασύρματα δίκτυα αισθητήρων, κατανεμημένα δίκτυα, ποιότητα υπηρεσιών, διαχείρηση κίνησης και διαχείρηση βασιζόμενη σε πολιτικές.");
        }

        private void label14_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Διευθυντής: Καθηγητής Παναγιωτόπουλος Θεμιστοκλής\r\nΑίθουσα: 212, Κεντρικό Κτίριο");
        }

        private void label10_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Σκοπός του εργαστηρίου είναι να εξυπηρετήσει τις ερευνητικές και εκπαιδευτικές ανάγκες του τμήματος σε θέματα όλων των επιμέρους γνωστικών αντικειμένων της Αρχιτεκτονικής, της Σχεδίασης και της Δοκιμής των Ενσωματωμένων Υπολογιστικών Συστημάτων, της Αυτοματοποίησης των Μεθοδολογιών Ανάπτυξης Υλικού και Λογισμικού των Υπολογιστικών Συστημάτων, των Μεθοδολογιών Αύξησης της Φερεγγυότητας, Αξιοπιστίας, Διαθεσιμότητας, Δοκιμαστικότητας και Συντηρησιμότητας των Υπολογιστικών Συστημάτων σε επίπεδο Αρχιτεκτονικής, Υλικού, Λογισμικού, Λειτουργικού Συστήματος και Συστήματος συνολικά.");
        }

        private void label9_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Tο όραμα του εργαστηρίου είναι να επιτύχει ακαδημαϊκή αριστεία στους τομείς της ασφάλειας και της ιδιωτικότητας στον κυβερνοχώρο και να προωθήσει τις δεξιότητες, τις γνώσεις, τις δυνατότητες και τις αξίες των φοιτητών μας. Οι καινοτόμες δραστηριότητες του εργαστηρίου πιστοποιούνται από τις ερευνητικές δραστηριότητες και τις σχετικές δημοσιεύσεις των μελών του, τις ευρείες συνεργασίες με εθνικούς, ευρωπαϊκούς και διεθνείς οργανισμούς και επιχειρήσεις, τη συμμετοχή σε πολλά έργα Ε&Α στον τομέα της κυβερνοασφάλειας, καθώς και σε πολλές εθνικές και διεθνείς ασκήσεις ασφάλειας. Το Εργαστήριο Ασφάλειας στοχεύει στη συνεχή παραγωγή έρευνας, καινοτομίας και ακαδημαϊκής αριστείας σε διάφορους τομείς της ασφάλειας στον κυβερνοχώρο και της ιδιωτικής ζωής.");
        }

        private void label8_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Διευθυντής: Καθηγητής Γεώργιος Τσιχριντζής\r\nΑίθουσα: 207, Κεντρικό Κτίριο");
        }

        private void label6_Click(object sender, EventArgs e)
        {
           
        }

        private void label18_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Διευθυντής: Αν. Καθηγητής Κωνσταντόπουλος Χαράλαμπος\r\nΑίθουσα: 103, Γρ. Λαμπράκη 126");
        }

        private void label15_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Tο εργαστήριο «Ψηφιακού Πολιτισμού, Έξυπνων Πόλεων, Διαδικτύου των Πραγμάτων (IoT) και Προηγμένων Ψηφιακών Τεχνολογιών και Υπηρεσιών» (DigiLab) δραστηριοποιείται στη διεξαγωγή ερευνητικού έργου σε θέματα που σχετίζονται άμεσα και έμμεσα με το γνωστικό αντικείμενο που περιγράφει ο τίτλος του, στην παροχή υπηρεσιών και συμβάλλει στην σύνδεση του τμήματος Πληροφορικής του Πανεπιστημίου Πειραιώς με εθνικούς και διεθνείς φορείς, επιχειρήσεις, οργανισμούς του Δημοσίου και Ιδιωτικού τομέα. Αποτελεί επιστημονικό φορέα παραγωγής βασικής κι εφαρμοσμένης έρευνας, μελέτης και ανάπτυξής της επιστημονικής γνώσης, καθώς και να καλύψει εκπαιδευτικές και ερευνητικές ανάγκες σε επίπεδο προπτυχιακό, μεταπτυχιακό, διδακτορικό και μεταδιδακτορικό του Πανεπιστημίου Πειραιώς.");
        }

        private void label7_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Το Εργαστήριο Επιστήμης Δεδομένων του Πανεπιστημίου Πειραιώς (Data Science Lab. – DataStories) δραστηριοποιείται ερευνητικά σε ένα πλήθος πεδίων της Επιστήμης Δεδομένων, όπως η διαχείριση μεγάλων δεδομένων, η στατιστική και η αναλυτική δεδομένων, η μηχανική μάθηση, η εξόρυξη γνώσης από βάσεις δεδομένων, κειμένων και ήχων, η εξερεύνηση δεδομένων κίνησης και η ιδιωτικότητα δεδομένων. ");
        }
    }
}
